# Decision Tree

In [ ]:
# import numpy as np
import pandas as pd
df=pd.read_csv("Z:/Study/ziggy std/Mr. Prakash Senapathi/Class Notes/19th april decision tree/5. DECESSION TREE CODE/Social_Network_Ads.csv")

In [89]:
df

      User ID  Gender  Age  EstimatedSalary  Purchased
0    15624510    Male   19            19000          0
1    15810944    Male   35            20000          0
2    15668575  Female   26            43000          0
3    15603246  Female   27            57000          0
4    15804002    Male   19            76000          0
..        ...     ...  ...              ...        ...
395  15691863  Female   46            41000          1
396  15706071    Male   51            23000          1
397  15654296  Female   50            20000          1
398  15755018    Male   36            33000          0
399  15594041  Female   49            36000          1

[400 rows x 5 columns]

In [90]:
df.head()

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510    Male   19            19000          0
1  15810944    Male   35            20000          0
2  15668575  Female   26            43000          0
3  15603246  Female   27            57000          0
4  15804002    Male   19            76000          0

In [91]:
df.isnull().sum()

User ID            0
Gender             0
Age                0
EstimatedSalary    0
Purchased          0
dtype: int64

as we can see that there is no null values in the dataset

In [92]:
del df['Gender']
del df['Age']

In [95]:
x=df.iloc[0:,:2]
x

      User ID  EstimatedSalary
0    15624510            19000
1    15810944            20000
2    15668575            43000
3    15603246            57000
4    15804002            76000
..        ...              ...
395  15691863            41000
396  15706071            23000
397  15654296            20000
398  15755018            33000
399  15594041            36000

[400 rows x 2 columns]

In [96]:
y=df.iloc[0:,-1:]
y

     Purchased
0            0
1            0
2            0
3            0
4            0
..         ...
395          1
396          1
397          1
398          0
399          1

[400 rows x 1 columns]

# Split the data into train test

In [97]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(x, y, test_size = 0.20, random_state = 0)
X_train

      User ID  EstimatedSalary
336  15664907           144000
64   15605000            83000
55   15649136            55000
106  15706185            35000
300  15736397            38000
..        ...              ...
323  15619465            30000
192  15779581            43000
117  15591433            52000
47   15776348            54000
172  15794661           118000

[320 rows x 2 columns]

In [100]:
# Feature Scaling
from sklearn.preprocessing import StandardScaler
sc=StandardScaler()
X_train_sc=sc.fit_transform(X_train)
X_test_sc=sc.transform(X_test)

In [156]:
from sklearn.tree import DecisionTreeClassifier
classifier = DecisionTreeClassifier(criterion="gini", splitter="best", max_depth=8, min_samples_split=7, min_samples_leaf=10,)
classifier.fit(X_train_sc,y_train)

DecisionTreeClassifier(max_depth=8, min_samples_leaf=10, min_samples_split=7)

In [157]:
y_pred = classifier.predict(X_test_sc)
y_pred

array([0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 1,
       0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0,
       1, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1, 0,
       0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 1, 1], dtype=int64)

In [158]:
y_test

     Purchased
132          0
309          0
341          0
196          0
246          0
..         ...
14           0
363          0
304          0
361          1
329          1

[80 rows x 1 columns]

In [159]:
from sklearn.metrics import confusion_matrix
cm = confusion_matrix(y_test, y_pred)
print(cm)

[[52  6]
 [10 12]]

In [147]:
from sklearn.metrics import accuracy_score
ac = accuracy_score(y_test, y_pred)
print(ac)

0.8

In [141]:
bias = classifier.score(X_train_sc, y_train)
bias

0.821875

In [142]:
variance = classifier.score(X_test_sc, y_test)
variance

0.8